"""
算术运行符：
+	加	两个对象相加 a + b 输出结果 30
-	减	得到负数或是一个数减去另一个数 a - b 输出结果 -10
*	乘	两个数相乘或是返回一个被重复若干次的字符串 a * b 输出结果 200
/	除	b / a 输出结果 2.0
//	取整除	返回商的整数部分 9//2 输出结果 4 , 9.0//2.0 输出结果 4.0
%	取余	返回除法的余数 b % a 输出结果 0
**	指数	a**b 为10的20次方， 输出结果 100000000000000000000
"""

# a = 10
# b = 25
# print(a + b) # 35
# print(a - b) # -15
# print(a * b) # 250
# print(b / a) # 2.5
# # 取整数
# print(b // a) # 2
# # 求余数
# print(b % a) # 5
#
# c = 2
# d = 3
# print(c ** d) # 8


"""
赋值运算符
= 先计算=号右边的结果，然后把结果赋值给=号左边的变量
"""

# a = 2
# b = 3
# # 先计算 a + b 的结果，然后把结果重新赋值给 a
# a = a + b
# print(a) # 5

"""
复合赋值运算符
+=	加法赋值运算符	c += a 等效于 c = c + a
-=	减法赋值运算符	c -= a 等效于 c = c - a
*=	乘法赋值运算符	c *= a 等效于 c = c * a
/=	除法赋值运算符	c /= a 等效于 c = c / a
%=	取模赋值运算符	c %= a 等效于 c = c % a
**=	幂赋值运算符	c **= a 等效于 c = c ** a
//=	取整除赋值运算符	c //= a 等效于 c = c // a
"""

a = 2
b = 3
a += b # 等效于 a = a + b
print(a) # 5

b %= a # 等效于 b = b % a -> b = 3 % 5 = 3
print(b) # 3






