"""
1*1=1
2*1=2  2*2=4
3*1=3  3*2=6  3*3=9
4*1=4  4*2=8  4*3=12  4*4=16
5*1=5  5*2=10  5*3=15  5*4=20  5*5=25
6*1=6  6*2=12  6*3=18  6*4=24  6*5=30  6*6=36
7*1=7  7*2=14  7*3=21  7*4=28  7*5=35  7*6=42  7*7=49
8*1=8  8*2=16  8*3=24  8*4=32  8*5=40  8*6=48  8*7=56  8*8=64
9*1=9  9*2=18  9*3=27  9*4=36  9*5=45  9*6=54  9*7=63  9*8=72  9*9=81
"""

# 外层循环：控制打印的行数
# for i in range(1, 10):
#     # 内层循环：控制每行打印的列数
#     for j in range(1, i+1):
#         print(f'{i}*{j}={i*j}', end='\t')
#
#     # 换行
#     print()


add = lambda x, y: x + y
minus = lambda x, y: x - y
mul = lambda x, y: x * y
div = lambda x, y: x / y


def compute(a, b, command):
    """
    a：接收一个数字
    b：接收另外一个数字
    command：接收一个函数名
    """
    res = command(a, b)
    print(res)


# compute(1, 2, add)
compute(1, 2, mul)








